{
  "pre_hm": {
    "king_slime": {
      "name": "👑 Король Слизней",
      "general": "Необязательный босс. Может появиться сам во время Дождя слизней или при использовании Короны.",
      "gear": "• **Оружие:** Любое дистанционное (Луки, Мушкет).\n• **Аксессуары:** Сапоги Гермеса.\n• **Важно:** Веревки, чтобы залезть высоко.",
      "tactics": "Постройте платформу или заберитесь по веревке на 30-40 блоков вверх. Босс не может прыгать так высоко и станет беспомощным.",
      "arena": "Просто ровная площадка. Главное — пространство для маневра, если вы сражаетесь на земле.",
      "drops": "Слизневое седло (маунт), Слизневый крюк, Ниндзя-сет, Королевский гель."
    },
    "eye_of_cthulhu": {
      "name": "👁️ Глаз Ктулху",
      "general": "Первый обязательный босс. Появляется ночью, если у вас 200+ HP и 10+ защиты.",
      "gear": "• **Оружие:** Золотой/Платиновый лук + Поджигающие стрелы.\n• **Аксессуары:** Сапоги Гермеса (обязательно).",
      "tactics": "В 1-й фазе убивайте маленьких слуг. Во 2-й фазе (когда у него появится рот) он начнет быстро рычать и делать рывки — в этот момент бегите в одну сторону и не останавливайтесь.",
      "arena": "2-3 длинных яруса платформ (по 100-150 блоков) с Кострами.",
      "drops": "Демонитовая/Кримтановая руда, Щит Глаза Ктулху (в Эксперте — лучший предмет начала игры)."
    },
    "eater_of_worlds": {
      "name": "🐛 Пожиратель Миров",
      "general": "Босс Искажения. Призывается уничтожением 3 Теневых сфер в подземных пещерах.",
      "gear": "• **Оружиe:** Пронзающее — Водяной выстрел, Копья, Мячи на цепи (Баллиста).\n• **Броня:** Золотая или Древняя теневая.",
      "tactics": "Босс состоит из сегментов. Цельтесь в голову — у нее меньше всего защиты, но самый высокий урон. Старайтесь не разбивать его на много мелких червей.",
      "arena": "Платформы прямо над расщелинами Искажения или большая расчищенная пещера внизу.",
      "drops": "Теневая чешуя и Демонитовая руда (нужны для Кирки кошмаров)."
    },
    "brain_of_cthulhu": {
      "name": "🧠 Мозг Ктулху",
      "general": "Босс Багрянца. Призывается уничтожением 3 Живых сердец.",
      "gear": "• **Оружие:** Оружие с массовым уроном — Гранаты, Копья, Хлыст слизня.\n• **Броня:** Золотая или Броня джунглей.",
      "tactics": "1 фаза: Мозг неуязвим, убейте всех Проныр (глаза). 2 фаза: Он начнет телепортироваться. Оригинал всегда выглядит более четким, чем иллюзии.",
      "arena": "Большой пустой квадрат в центре биома Багрянца. Обязательно Лампы с сердцем.",
      "drops": "Тканевые образцы и Кримтановая руда."
    },
    "queen_bee": {
      "name": "🐝 Королева Пчел",
      "general": "Обитает в Ульях джунглей. Призывается при разрушении Личинки.",
      "gear": "• **Оружие:** Миниакула или Пчелиный лук.\n• **Аксессуары:** Безоар (дает иммунитет к яду).",
      "tactics": "Когда она делает горизонтальные рывки — перепрыгивайте их. Когда зависает и выпускает пчел — бейте массовым оружием.",
      "arena": "Платформы внутри самого улья. Уберите мед (он замедляет, но дает реген).",
      "drops": "Пчелонаты (лучшее оружие против Стены Плоти), Воск, Медовые очки."
    },
    "skeletron": {
      "name": "💀 Скелетрон",
      "general": "Страж Данжа. Прокляните старика ночью у входа в крепость.",
      "gear": "• **Оружие:** Миниакула, Пчелиный лук или Костлявые ножи.\n• **Броня:** Некро-броня или Литая.",
      "tactics": "Сначала фокусируйте весь урон на РУКАХ. После их уничтожения голова станет уязвимой. Когда голова крутится — убегайте!",
      "arena": "3-4 яруса длинных платформ прямо над Данжем.",
      "drops": "Доступ в Данж, Рука скелетрона (крюк), Книга заклинаний."
    },
    "deerclops": {
      "name": "🦌 Циклоп-олень",
      "general": "Босс снежного биома. Призывается Оленьей штукой или сам в полночь в метель.",
      "gear": "• **Оружие:** Любое дальнее.\n• **Аксессуары:** Теплая одежда или Сапоги для льда.",
      "tactics": "Не отходите слишком далеко (он станет неуязвимым). Прыгайте через ледяные шипы и не наступайте на его тени.",
      "arena": "Ровная поверхность снега, платформы почти не нужны.",
      "drops": "Радиоштучка, Глазозонтик, Топор Люси (говорит с вами)."
    },
    "wall_of_flesh": {
      "name": "🔥 Стена Плоти",
      "general": "ФИНАЛЬНЫЙ босс до-хардмода. Призывается в Аду броском куклы Вуду гида в лаву.",
      "gear": "• **Оружие:** Пчелонаты (Beenades) — уничтожают её мгновенно.\n• **Зелья:** Хождение по воде, Острое зрение, Регенерация.",
      "tactics": "Бейте ТОЛЬКО в глаза. Постоянно отступайте по мосту. Чем меньше у нее HP, тем быстрее она движется.",
      "arena": "Очень длинная и ровная дорога (мост) через половину Ада.",
      "drops": "Святой молот (открывает хардмод), Эмблемы на классы."
    }
  },
  "hm": {
    "queen_slime": {
      "name": "👑 Королева Слизней",
      "general": "Хардмод версия слизня. Призывается Осколком желатина в Освящении.",
      "gear": "• **Оружие:** Лук Дедала.\n• **Аксессуары:** Крылья (обязательно).",
      "tactics": "Во второй фазе она отращивает крылья. Постоянно летайте по диагонали, чтобы её снаряды в вас не попали.",
      "arena": "Длинная дорога в небе или на поверхности Освящения.",
      "drops": "Кристальная броня, маунт Крюк Слизи."
    },
    "destroyer": {
      "name": "🤖 Уничтожитель",
      "general": "Механический червь. Первый из трех меха-боссов.",
      "gear": "• **Оружие:** Лук Дедала + Святые стрелы (обрушивают звезды на все тело).\n• **Броня:** Адамантитовая/Титановая.",
      "tactics": "Не стойте на земле! Постройте коробку высоко в небе. Его дроны — источник сердечек для лечения.",
      "arena": "Платформа на высоте 100+ блоков над землей.",
      "drops": "Святые слитки, Души могущества."
    },
    "twins": {
      "name": "👁️👁️ Близнецы",
      "general": "Два глаза: Спазматизм (зеленый) и Ретинайзер (красный).",
      "gear": "• **Оружие:** Мега-акула + Хлорофитовые пули (самонаводка).\n• **Аксессуары:** Быстрые крылья.",
      "tactics": "Сначала убейте Спазматизма! Его проклятый огонь во второй фазе смертелен. Ретинайзер проще, его можно расстрелять издалека.",
      "arena": "Очень длинная асфальтовая дорога в небе.",
      "drops": "Святые слитки, Души зрения."
    },
    "skeletron_prime": {
      "name": "💀 Скелетрон Прайм",
      "general": "Самый сложный из Мехов. Имеет 4 разные руки.",
      "gear": "• **Оружие:** Мега-акула или Терра-меч.\n• **Броня:** Святая броня.",
      "tactics": "Фокусируйте урон на ГОЛОВЕ. Если уничтожить голову, босс умрет, даже если руки остались.",
      "arena": "Классическая арена с лампами, кострами и медом.",
      "drops": "Святые слитки, Души страха."
    },
    "plantera": {
      "name": "🌸 Плантера",
      "general": "Появляется после поломки Розового бутона в подземных джунглях.",
      "gear": "• **Оружие:** Хлорофитовый стрелострел, Терра-меч.\n• **Броня:** Хлорофитовая.",
      "tactics": "Выкопайте огромную пещеру. Во второй фазе летайте по кругу вокруг Плантеры, чтобы она не зажала вас.",
      "arena": "Квадрат 150х150 блоков в джунглях, очищенный от стен.",
      "drops": "Ключ от Храма Голема, Гитары, Цветок Плантеры."
    },
    "golem": {
      "name": "🗿 Голем",
      "general": "Находится в конце Храма Джунглей. Используйте Батарейку на алтаре.",
      "gear": "• **Оружие:** Вампирские ножи или оружие Плантеры.\n• **Броня:** Жучья броня (если вы воин).",
      "tactics": "Сначала выбейте руки. Когда голова взлетит, просто бегайте влево-вправо, уворачиваясь от лучей.",
      "arena": "Заставьте комнату ловушками из самого храма для дополнительного урона.",
      "drops": "Киркопил (Picksaw), Жучьи панцири."
    },
    "duke_fishron": {
      "name": "🐟 Герцог Рыброн",
      "general": "Призывается Трюфельным червем в Океане. Очень быстрый!",
      "gear": "• **Оружие:** Тактический дробовик или Посох морозной гидры.\n• **Аксессуары:** Щит Анх или Мастерское снаряжение ниндзя.",
      "tactics": "В 3-й фазе экран темнеет. Он атакует по схеме: 1 рывок, телепорт, 2 рывка, телепорт, 3 рывка. Следите за его светящимися глазами.",
      "arena": "Платформы над океаном через весь экран.",
      "drops": "Цунами (лучший лук), Бритвенный тайфун (лучшая магия)."
    },
    "empress_of_light": {
      "name": "🦋 Императрица Света",
      "general": "Призывается убийством Призматической златоглазки в Освящении ночью.",
      "gear": "• **Оружие:** Максимальная дальность.\n• **Броня:** На уклонение (Броня тени/Черная ниндзя).",
      "tactics": "Это босс-танец. Все её атаки имеют четкий рисунок. Главное — выучить, куда лететь во время 'Солнечного танца'.",
      "arena": "Бесконечная дорога в небе.",
      "drops": "Террапризма (если победить днем — это сложнейшее испытание в игре)."
    },
    "moon_lord": {
      "name": "🌑 Мунлорд",
      "general": "ФИНАЛЬНЫЙ БОСС. Появляется после уничтожения Небесных башен.",
      "gear": "• **Оружие:** Солнечная вспышка, Посох дракона, Фантазм.\n• **Броня:** Из фрагментов башен.",
      "tactics": "Уничтожьте три глаза одновременно. Когда верхний глаз открывается — готовьтесь взлетать, чтобы увернуться от гигантского лазера.",
      "arena": "Длинная дорога из асфальта через весь мир или 'дом безопасности' с медсестрой.",
      "drops": "Люминит (для лучшей брони), Зенит (компоненты), Мяумур."
    }
  }
}
